Autodesk.Revit.DB.Mechanical.EquipmentClassification
This enumeration is used to classify the mechanical equipment.
Since:
2019
Since:
2019

Autodesk.Revit.DB.Mechanical.EquipmentClassification.Pump
The pump equipment.

Autodesk.Revit.DB.Mechanical.EquipmentClassification.None
The undefined equipment type.